#ifndef ADC_H_
#define ADC_H_
//*****************************************************************************
//
// 如果使用c++编译器构建，则使此头文件中的所有定义都具有C绑定。
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

extern uint16_t adcAResult[5];

void InitAdc(void);
__interrupt void ADC_ISR(void);
void LowPassFilter(float *Out, float In);//一阶低通滤波器
//*****************************************************************************
//
// 标记c++编译器的C绑定部分的末尾。
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif /* ADC_H_ */

